toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
#include "System.h"
#include "Assert.h"
#include "SystemClock.h"
#include "Startup.h"

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static uint8_t _pixBuf0[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));
static uint8_t _pixBuf1[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));

using namespace STApp;

using EchoMsg = ICE40::EchoMsg;
using EchoResp = ICE40::EchoResp;
using SDClkSrcMsg = ICE40::SDClkSrcMsg;
using SDSendCmdMsg = ICE40::SDSendCmdMsg;
using SDGetStatusMsg = ICE40::SDGetStatusMsg;
using SDGetStatusResp = ICE40::SDGetStatusResp;
using PixResetMsg = ICE40::PixResetMsg;
using PixCaptureMsg = ICE40::PixCaptureMsg;
using PixReadoutMsg = ICE40::PixReadoutMsg;
using PixI2CTransactionMsg = ICE40::PixI2CTransactionMsg;
using PixI2CStatusMsg = ICE40::PixI2CStatusMsg;
using PixI2CStatusResp = ICE40::PixI2CStatusResp;
using PixCaptureStatusMsg = ICE40::PixCaptureStatusMsg;
using PixCaptureStatusResp = ICE40::PixCaptureStatusResp;

using SDRespTypes = ICE40::SDSendCmdMsg::RespTypes;
using SDDatInTypes = ICE40::SDSendCmdMsg::DatInTypes;

System::System() :
// QSPI clock divider=1 => run QSPI clock at 64 MHz
// QSPI alignment=word for high performance transfers
_qspi(QSPI::Mode::Dual, 1, QSPI::Align::Word),
_pixBufs(_pixBuf0, _pixBuf1) {
}

static QSPI_CommandTypeDef _ice40QSPICmd(const ICE40::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
    // When dual-flash quadspi is enabled, the supplied address is
    // divided by 2, so we left-shift `addr` in anticipation of that.
    // But by doing so, we throw out the high bit of `msg`, so we
    // require it to be 0.
    AssertArg(!(b[0] & 0x80));
    
    return QSPI_CommandTypeDef{
        .Instruction = 0xFF,
        .InstructionMode = QSPI_INSTRUCTION_4_LINES,
        
        // When dual-flash quadspi is enabled, the supplied address is
        // divided by 2, so we left-shift `addr` in anticipation of that.
        .Address = (
            (uint32_t)b[0]<<24  |
            (uint32_t)b[1]<<16  |
            (uint32_t)b[2]<<8   |
            (uint32_t)b[3]<<0
        ) << 1,
//            .Address = 0,
        .AddressSize = QSPI_ADDRESS_32_BITS,
        .AddressMode = QSPI_ADDRESS_4_LINES,
        
        .AlternateBytes = (
            (uint32_t)b[4]<<24  |
            (uint32_t)b[5]<<16  |
            (uint32_t)b[6]<<8   |
            (uint32_t)b[7]<<0
        ),
//            .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_32_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_4_LINES,
        
        .DummyCycles = 4,
        
        .NbData = (uint32_t)respLen,
        .DataMode = (respLen ? QSPI_DATA_4_LINES : QSPI_DATA_NONE),
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    qspi.command(_ice40QSPICmd(msg, 0));
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

template <typename T>
static T _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    T resp;
    qspi.read(_ice40QSPICmd(msg, sizeof(resp)), &resp, sizeof(resp));
    qspi.eventChannel.read(); // Wait for the transfer to complete
    return resp;
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

static void _ice40TransferAsync(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
}

class MSP430 {
private:
    using TMS = bool;
    static constexpr TMS TMS0 = false;
    static constexpr TMS TMS1 = true;
    static constexpr TMS TMSX = false; // Don't care
    
    using TDI = bool;
    static constexpr TDI TDI0 = false;
    static constexpr TDI TDI1 = true;
    static constexpr TDI TDIX = false; // Don't care
    
    using TDO = bool;
    static constexpr TDO TDO0 = false;
    static constexpr TDO TDO1 = true;
    static constexpr TDO TDOX = false; // Don't care
    
    void _sbwDelay(uint32_t count=100) {
        for (volatile uint32_t i=0; i<count; i++);
    }
    
    void _delayMs(uint32_t ms) {
        IRQState irq;
        irq.enable();
        HAL_Delay(ms);
    }
    
    void _delayUs(uint32_t us) {
        _sbwDelay(4*us);
    }
    
    #include "MSP430.h"
    
    GPIO& _mspTest;
    GPIO& _mspRst_;
    GPIO& _sbwTCK;
    GPIO& _sbwTDIO;
    IRQState _irq;
    
public:
    MSP430(GPIO& mspTest, GPIO& mspRst_) :
    _mspTest(mspTest), _mspRst_(mspRst_),
    _sbwTCK(mspTest), _sbwTDIO(mspRst_)
    {}
    
    void go() {
        _mspTest.config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        _mspTest.write(0);
        
        for (;;) {
            _mspRst_.write(1);
            _mspRst_.config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
            _sbwDelay();
            _mspRst_.config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
            _sbwDelay(1000);
            
            _mspRst_.write(0);
            _mspRst_.config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
            _sbwDelay();
            _mspRst_.config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
            _sbwDelay(1000);
        }
        
        
        
        
//        volatile uint16_t coreID = GetCoreID();
        for (;;);
    }
    
//    void go() {
//        _irq.disable();
//        
//        #define IR_CNTRL_SIG_16BIT	    0xC8	/* 0x13 */
//        #define IR_CNTRL_SIG_CAPTURE	0x28	/* 0x14 */
//        #define IR_JMB_EXCHANGE         0x86    /* 0x61 */
////        #define IR_CNTRL_SIG_16BIT	0x13
////        #define IR_CNTRL_SIG_CAPTURE	0x14
//        
//        // ## JTAG entry, attempt 1
//        {
//            // ## Reset pin states
//            {
//                _mspTest.write(0);
//                _mspRst_.write(1);
//                for (uint32_t i=0; i<65535; i++) {
//                    _sbwDelay();
//                }
//            }
//            
//            // ## Reset the MSP430 so that it starts from a known state
//            {
//                _mspRst_.write(0);
//                _sbwDelay();
//                _mspRst_.write(1);
//                _sbwDelay();
//            }
//            
//            // ## Enable SBW interface
//            {
//                // Assert TEST
//                _mspTest.write(1);
//                _sbwDelay();
//            }
//            
//            // ## Choose 2-wire/Spy-bi-wire mode
//            {
//                // SBWTDIO=1, and apply a single clock to SBWTCK
//                _sbwTDIO.write(1);
//                _sbwDelay();
//                _sbwTCK.write(0);
//                _sbwDelay();
//                _sbwTCK.write(1);
//                _sbwDelay();
//            }
//
//            // ## Reset JTAG state machine
//            {
//                // TMS=1 for 6 clocks
//                for (int i=0; i<100; i++) {
//                    _sbwio(TMS1, TDIX);
//                }
//                // <-- Test-Logic-Reset
//                
//                // TMS=0 for 1 clock
//                _sbwio(TMS0, TDIX);
//                // <-- Run-Test/Idle
//                
//                // Fuse check: toggle TMS twice
//                _sbwio(TMS1, TDIX);
//                // <-- Select DR-Scan
//                _sbwio(TMS0, TDIX);
//                // <-- Capture DR
//                _sbwio(TMS1, TDIX);
//                // <-- Exit1-DR
//                _sbwio(TMS0, TDIX);
//                // <-- Pause-DR
//                _sbwio(TMS1, TDIX);
//                // <-- Exit2-DR
//                
//                // In SBW mode, the fuse check causes the JTAG state machine to change states,
//                // so we need to explicitly return to the Run-Test/Idle state.
//                // (This isn't necessary in 4-wire JTAG mode, since the state machine doesn't
//                // change states when performing the fuse check.)
//                _sbwio(TMS1, TDIX);
//                // <-- Update-DR
//                _sbwio(TMS0, TDIX);
//                // <-- Run-Test/Idle
//            }
//            
//            // Try to read JTAG ID
//            {
//                _startShiftIR();
//                _shift<uint8_t>(IR_CNTRL_SIG_16BIT);
//                
//                _startShiftDR();
//                _shift<uint16_t>(0x2401);
//                
//                volatile uint8_t jtagID = _shift<uint8_t>(IR_CNTRL_SIG_CAPTURE);
//                for (;;);
//            }
//        }
//        
//        // ## JTAG entry, attempt 2
//        {
//            // ## Reset pin states
//            {
//                _mspTest.write(0);
//                _mspRst_.write(1);
//                for (uint32_t i=0; i<65535; i++) {
//                    _sbwDelay();
//                }
//            }
//            
//            // ## Reset the MSP430 so that it starts from a known state
//            {
//                _mspRst_.write(0);
//                _sbwDelay();
//            }
//            
//            // ## Enable SBW interface
//            {
//                // Assert TEST
//                _mspTest.write(1);
//                _sbwDelay();
//            }
//            
//            // ## Choose 2-wire/Spy-bi-wire mode
//            {
//                // SBWTDIO=1, and apply a single clock to SBWTCK
//                _sbwTDIO.write(1);
//                _sbwDelay();
//                _sbwTCK.write(0);
//                _sbwDelay();
//                _sbwTCK.write(1);
//                _sbwDelay();
//            }
//            
//            // ## Reset JTAG state machine
//            {
//                // TMS=1 for 6 clocks
//                for (int i=0; i<100; i++) {
//                    _sbwio(TMS1, TDIX);
//                }
//                // <-- Test-Logic-Reset
//                
//                // TMS=0 for 1 clock
//                _sbwio(TMS0, TDIX);
//                // <-- Run-Test/Idle
//                
//                // Fuse check: toggle TMS twice
//                _sbwio(TMS1, TDIX);
//                // <-- Select DR-Scan
//                _sbwio(TMS0, TDIX);
//                // <-- Capture DR
//                _sbwio(TMS1, TDIX);
//                // <-- Exit1-DR
//                _sbwio(TMS0, TDIX);
//                // <-- Pause-DR
//                _sbwio(TMS1, TDIX);
//                // <-- Exit2-DR
//                
//                // In SBW mode, the fuse check causes the JTAG state machine to change states,
//                // so we need to explicitly return to the Run-Test/Idle state.
//                // (This isn't necessary in 4-wire JTAG mode, since the state machine doesn't
//                // change states when performing the fuse check.)
//                _sbwio(TMS1, TDIX);
//                // <-- Update-DR
//                _sbwio(TMS0, TDIX);
//                // <-- Run-Test/Idle
//            }
//            
//            {
//                _startShiftIR();
//                _shift<uint8_t>(IR_JMB_EXCHANGE);
//                
//                _startShiftDR();
//                _shift<uint16_t>(0xA55A);
//            }
//            
//            // ## Reset the MSP430 so that it starts from a known state
//            {
//                _mspRst_.write(1);
//                _sbwDelay();
//            }
//        }
//        
//        _irq.restore();
//    }
};

void System::init() {
    _super::init();
    _usb.init();
    _qspi.init();
    
    MSP430 msp(_mspTest, _mspRst_);
    msp.go();
}




//// Test QSPI
//void System::_handleEvent() {
//    // Confirm that we can communicate with the ICE40
//    {
//        char str[] = "halla";
//        volatile auto status = _ice40Transfer<EchoResp>(_qspi, EchoMsg(str));
//        Assert(!strcmp((char*)status.payload, str));
//    }
//    
//    // Test reading a chunk of data
//    for (;;) {
//        static uint8_t respDataChunk[65532];
//        Msg msg;
//        msg.type = 0x01;
//        _ice40Transfer(_qspi, msg, (void*)respDataChunk, sizeof(respDataChunk));
//        // Confirm the data is what we expect
//        for (size_t i=0; i<sizeof(respDataChunk); i++) {
//            if (!(i % 2))   Assert(respDataChunk[i] == 0x37);
//            else            Assert(respDataChunk[i] == 0x42);
//        }
//    }
//    
//    for (;;);
//}

