toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
        // Reset our state
        _qspi.reset();
        _pixStatus.state = PixState::Idle;
        _pixBufs.reset();
        
        // Prepare to receive commands
        _usb.cmdRecv();
    irq.restore();
    
    // Confirm that we can communicate with the ICE40.
    // Interrupts need to be enabled for this, since _ice40Transfer()
    // waits for a response on qspi.eventChannel.
    char str[] = "halla";
    auto status = _ice40Transfer<EchoResp>(_qspi, EchoMsg(str));
    Assert(!strcmp((char*)status.payload, str));
}

void System::_handleEvent() {
    // Wait for an event to occur on one of our channels
    ChannelSelect::Start();
    if (auto x = _usb.eventChannel.readSelect()) {
        _handleUSBEvent(*x);
    
    } else if (auto x = _usb.resetChannel.readSelect()) {
        _reset(true);
    
    } else if (auto x = _usb.cmdChannel.readSelect()) {
        _handleCmd(*x);
    
    } else if (auto x = _qspi.eventChannel.readSelect()) {
        _handleQSPIEvent(*x);
    
    } else if (auto x = _usb.pixChannel.readSelect()) {
        _handlePixUSBEvent(*x);
    
    } else {
        // No events, go to sleep
        ChannelSelect::Wait();
    }
}

void System::_handleUSBEvent(const USB::Event& ev) {
    using Type = USB::Event::Type;
    switch (ev.type) {
    case Type::StateChanged: {
        // Handle USB connection
        if (_usb.state() == USB::State::Connected) {
            _reset(false);
        }
        break;
    }
    
    default: {
        // Invalid event type
        abort();
    }}
}

void System::_handleCmd(const USB::Cmd& ev) {
    Cmd cmd;
    Assert(ev.len == sizeof(cmd)); // TODO: handle errors
    memcpy(&cmd, ev.data, ev.len);
    
    switch (cmd.op) {
    // PixGetStatus
    case Cmd::Op::PixGetStatus: {
        _usb.cmdSend(&_pixStatus, sizeof(_pixStatus));
        break;
    }
    
    // PixReset
    case Cmd::Op::PixReset: {
        _pixReset();
        break;
    }
    
    // PixI2CTransaction
    case Cmd::Op::PixI2CTransaction: {
        auto& arg = cmd.arg.pixI2CTransaction;
        if (arg.write)  _pixI2CWrite(arg.addr, arg.val);
        else            _pixI2CRead(arg.addr);
        break;
    }
    
    // PixCapture
    case Cmd::Op::PixCapture: {
        if (_pixStatus.state == PixState::Idle) {
            _pixCapture();
        }
        break;
    }
    
    // LEDSet
    case Cmd::Op::LEDSet: {
        switch (cmd.arg.ledSet.idx) {
//        case 0: _led0.write(cmd.arg.ledSet.on); break;
//        case 1: _led1.write(cmd.arg.ledSet.on); break;
        case 2: _led2.write(cmd.arg.ledSet.on); break;
        case 3: _led3.write(cmd.arg.ledSet.on); break;
        }
        
        break;
    }
    
    // Bad command
    default: {
        break;
    }}
    
    // Prepare to receive another command
    _usb.cmdRecv(); // TODO: handle errors
}

void System::_handleQSPIEvent(const QSPI::Signal& ev) {
    Assert(_pixStatus.state == PixState::Capturing); // We should only be called while capturing
    Assert(_pixBufs.writable());
    
    const bool wasReadable = _pixBufs.readable();
    
    // Enqueue the buffer
    {
        // Update the number of remaining bytes to receive from the image sensor
        _pixRemLen -= _pixBufs.writeBuf().len;
        _pixBufs.writeEnqueue();
    }
    
    // Start a USB transaction when we go from 0->1 buffers
    if (!wasReadable) {
        _sendPixDataOverUSB();
    }
    
    // Prepare to receive more data if we're expecting more,
    // and we have a buffer to store the data in
    if (_pixRemLen && _pixBufs.writable()) {
        _recvPixDataFromICE40();
    }
}

void System::_handlePixUSBEvent(const USB::Signal& ev) {
    Assert(_pixStatus.state == PixState::Capturing); // We should only be called while capturing
    Assert(_pixBufs.readable());
    const bool wasWritable = _pixBufs.writable();
    
    // Dequeue the buffer
    _pixBufs.readDequeue();
    
    // Start another USB transaction if there's more data to write
    if (_pixBufs.readable()) {
        _sendPixDataOverUSB();
    }
    
    if (_pixRemLen) {
        // Prepare to receive more data if we're expecting more,
        // and we were previously un-writable
        if (!wasWritable) {
            _recvPixDataFromICE40();
        }
    } else if (!_pixBufs.readable()) {
        _pixStatus.state = PixState::Idle;
        
        // We're done sending this image, start the next one
//        _pixCapture();
    }
}

// Arrange for pix data to be received from ICE40
void System::_recvPixDataFromICE40() {
    Assert(_pixBufs.writable());
    
    // TODO: ensure that the byte length is aligned to a u32 boundary, since QSPI requires that!
    const size_t len = std::min(_pixRemLen, _pixBufs.writeBuf().cap);
    // Determine whether this is the last readout, and therefore the ice40 should automatically
    // capture the next image when readout is done.
//    const bool captureNext = (len == _pixRemLen);
    const bool captureNext = false;
    _pixBufs.writeBuf().len = len;
    
    _ice40TransferAsync(_qspi, PixReadoutMsg(0, captureNext, len/sizeof(Pixel)),
        _pixBufs.writeBuf().data,
        _pixBufs.writeBuf().len);
}

// Arrange for pix data to be sent over USB
void System::_sendPixDataOverUSB() {
    Assert(_pixBufs.readable());
    const auto& buf = _pixBufs.readBuf();
    _usb.pixSend(buf.data, buf.len);
}

void System::_pixReset() {
    _ice40Transfer(_qspi, PixResetMsg(false));
    HAL_Delay(1);
    _ice40Transfer(_qspi, PixResetMsg(true));
    // Wait 150k EXTCLK (24MHz) periods
    // (150e3*(1/24e6)) == 6.25ms
    HAL_Delay(7);
}

//void System::_pixConfig() {
//    // Confirm that we can communicate with the ICE40
//    {
//        char str[] = "halla";
//        auto status = _ice40Transfer<EchoResp>(_qspi, EchoMsg(str));
//        Assert(!strcmp((char*)status.payload, str));
//    }
//    
//    // Assert/deassert pix reset
//    {
//        _ice40Transfer(_qspi, PixResetMsg(false));
//        HAL_Delay(1);
//        _ice40Transfer(_qspi, PixResetMsg(true));
//        // Wait 150k EXTCLK (24MHz) periods
//        // (150e3*(1/24e6)) == 6.25ms
//        HAL_Delay(7);
//    }
//    
//    // Sanity-check pix comms by reading a known register
//    {
//        const uint16_t chipVersion = _pixI2CRead(0x3000);
//        // TODO: we probably don't want to check the version number in production, in case the version number changes?
//        // also the 0x3000 isn't read-only, so in theory it could change
//        Assert(chipVersion == 0x2604);
//    }
//    
//    // Configure internal register initialization
//    {
//        _pixI2CWrite(0x3052, 0xA114);
//    }
//    
//    // Start internal register initialization
//    {
//        _pixI2CWrite(0x304A, 0x0070);
//    }
//    
//    // Wait 150k EXTCLK (24MHz) periods
//    // (150e3*(1/24e6)) == 6.25ms
//    {
//        HAL_Delay(7);
//    }
//    
//    // Enable parallel interface (R0x301A[7]=1), disable serial interface to save power (R0x301A[12]=1)
//    // (Default value of 0x301A is 0x0058)
//    {
//        _pixI2CWrite(0x301A, 0x10D8);
//    }
//    
//    // Set pre_pll_clk_div
//    {
////        _pixI2CWrite(0x302E, 0x0002);  // /2 -> CLK_OP=98 MHz
////        _pixI2CWrite(0x302E, 0x0004);  // /4 -> CLK_OP=49 MHz (Default)
////        _pixI2CWrite(0x302E, 0x003F);  // /63
//    }
//    
//    // Set pll_multiplier
//    {
////        _pixI2CWrite(0x3030, 0x0062);  // *98 (Default)
////        _pixI2CWrite(0x3030, 0x0031);  // *49
//    }
//    
//    // Set vt_pix_clk_div
//    {
////        _pixI2CWrite(0x302A, 0x0006);  // /6 (Default)
////        _pixI2CWrite(0x302A, 0x001F);  // /31
//    }
//    
//    // Set op_pix_clk_div
//    {
////        _pixI2CWrite(0x3036, 0x000A);
//    }
//    
//    // Set output slew rate
//    {
////        _pixI2CWrite(0x306E, 0x0010);  // Slow
////        _pixI2CWrite(0x306E, 0x9010);  // Medium (default)
//        _pixI2CWrite(0x306E, 0xFC10);  // Fast
//    }
//    
//    // Set data_pedestal
//    {
////        _pixI2CWrite(0x301E, 0x00A8);  // Default
////        _pixI2CWrite(0x301E, 0x0000);
//    }
//    
//    // Set test data colors
//    {
////        // Set test_data_red
////        _pixI2CWrite(0x3072, 0x0B2A);  // AAA
////        _pixI2CWrite(0x3072, 0x0FFF);  // FFF
////
////        // Set test_data_greenr
////        _pixI2CWrite(0x3074, 0x0C3B);  // BBB
////        _pixI2CWrite(0x3074, 0x0FFF);  // FFF
////
////        // Set test_data_blue
////        _pixI2CWrite(0x3076, 0x0D4C);  // CCC
////        _pixI2CWrite(0x3076, 0x0FFF);  // FFF
////
////        // Set test_data_greenb
////        _pixI2CWrite(0x3078, 0x0C3B);  // BBB
////        _pixI2CWrite(0x3078, 0x0FFF);  // FFF
//    }
//    
//    // Set test_pattern_mode
//    {
//        // 0: Normal operation (generate output data from pixel array)
//        // 1: Solid color test pattern.
//        // 2: Full color bar test pattern
//        // 3: Fade-to-gray color bar test pattern
//        // 256: Walking 1s test pattern (12 bit)
////        _pixI2CWrite(0x3070, 0x0000);  // Normal operation
////        _pixI2CWrite(0x3070, 0x0001);  // Solid color
////        _pixI2CWrite(0x3070, 0x0002);  // Color bars
////        _pixI2CWrite(0x3070, 0x0003);  // Fade-to-gray
////        _pixI2CWrite(0x3070, 0x0100);  // Walking 1s
//    }
//    
//    // Set serial_format
//    // *** This register write is necessary for parallel mode.
//    // *** The datasheet doesn't mention this. :(
//    // *** Discovered looking at Linux kernel source.
//    {
//        _pixI2CWrite(0x31AE, 0x0301);
//    }
//    
//    // Set data_format_bits
//    // Datasheet:
//    //   "The serial format should be configured using R0x31AC.
//    //   This register should be programmed to 0x0C0C when
//    //   using the parallel interface."
//    {
//        _pixI2CWrite(0x31AC, 0x0C0C);
//    }
//    
//    // Set row_speed
//    {
////        _pixI2CWrite(0x3028, 0x0000);  // 0 cycle delay
////        _pixI2CWrite(0x3028, 0x0010);  // 1/2 cycle delay (default)
//    }
//
//    // Set the x-start address
//    {
////        _pixI2CWrite(0x3004, 0x0006);  // Default
////        _pixI2CWrite(0x3004, 0x0010);
//    }
//
//    // Set the x-end address
//    {
////        _pixI2CWrite(0x3008, 0x0905);  // Default
////        _pixI2CWrite(0x3008, 0x01B1);
//    }
//
//    // Set the y-start address
//    {
////        _pixI2CWrite(0x3002, 0x007C);  // Default
////        _pixI2CWrite(0x3002, 0x007C);
//    }
//
//    // Set the y-end address
//    {
////        _pixI2CWrite(0x3006, 0x058b);  // Default
////        _pixI2CWrite(0x3006, 0x016B);
//    }
//    
//    // Implement "Recommended Default Register Changes and Sequencer"
//    {
//        _pixI2CWrite(0x3ED2, 0x0146);
//        _pixI2CWrite(0x3EDA, 0x88BC);
//        _pixI2CWrite(0x3EDC, 0xAA63);
//        _pixI2CWrite(0x305E, 0x00A0);
//    }
//    
//    // Disable embedded_data (first 2 rows of statistic info)
//    // See AR0134_RR_D.pdf for info on statistics format
//    {
////        _pixI2CWrite(0x3064, 0x1902);  // Stats enabled (default)
//        _pixI2CWrite(0x3064, 0x1802);  // Stats disabled
//    }
//    
//    // Start streaming
//    // (Previous value of 0x301A is 0x10D8, as set above)
//    {
//        _pixI2CWrite(0x301A, 0x10DC);
//    }
//    
//    // Tell ICE40 to do a capture
//    {
//        _ice40Transfer(_qspi, PixCaptureMsg(0));
//    }
//}

